In [1]:
import pandas as pd

In [2]:
df_countries=pd.read_csv("countries_with_continent.csv")
df_countries.head()

     Country  Population     Area       GDP  Continent
0      China     1398.72  9596.96  12234.78       Asia
1      India     1351.16  3287.26   2575.67       Asia
2         US      329.74  9833.52  19485.39  N.America
3  Indonesia      268.07  1910.93   1015.54       Asia
4     Brazil      210.32  8515.77   2055.51  S.America

Count the number of countries in each continent using Pandas.

In [4]:
df_countries.groupby("Continent")["Country"].count()

Continent
Africa       2
Asia         7
Europe       5
N.America    3
Oceania      1
S.America    2
Name: Country, dtype: int64

In [ ]:
# df_countries.groupby("Continent")["Country"].count()

Calculate the average GDP of countries in each continent using Pandas.

In [6]:
# aggregate=count, mean, sum, max ,min

In [5]:
df_countries.head(2)

  Country  Population     Area       GDP Continent
0   China     1398.72  9596.96  12234.78      Asia
1   India     1351.16  3287.26   2575.67      Asia

In [7]:
df_countries.groupby("Continent")["GDP"].mean()

Continent
Africa        271.665000
Asia         3057.941429
Europe       2476.302000
N.America    7430.246667
Oceania      1408.680000
S.America    1346.500000
Name: GDP, dtype: float64

Calculate the average Area of  in each continent usi`ng Pandas.

In [11]:
df_countries.head()

     Country  Population     Area       GDP  Continent
0      China     1398.72  9596.96  12234.78       Asia
1      India     1351.16  3287.26   2575.67       Asia
2         US      329.74  9833.52  19485.39  N.America
3  Indonesia      268.07  1910.93   1015.54       Asia
4     Brazil      210.32  8515.77   2055.51  S.America

In [12]:
df_countries.groupby("Continent")["Area"].mean()

Continent
Africa       1652.755000
Asia         2703.928571
Europe       3727.976000
N.America    7260.856667
Oceania      7692.020000
S.America    5648.085000
Name: Area, dtype: float64

Filter out the rows with Continent as Asia

In [ ]:
df.loc[index of rows,Name of columns]

In [16]:
df_countries.loc[0:5,]

     Country  Population     Area       GDP  Continent
0      China     1398.72  9596.96  12234.78       Asia
1      India     1351.16  3287.26   2575.67       Asia
2         US      329.74  9833.52  19485.39  N.America
3  Indonesia      268.07  1910.93   1015.54       Asia
4     Brazil      210.32  8515.77   2055.51  S.America
5   Pakistan      205.71   881.91    302.14       Asia

In [18]:
df_countries["Continent"]

0          Asia
1          Asia
2     N.America
3          Asia
4     S.America
5          Asia
6        Africa
7          Asia
8        Europe
9     N.America
10         Asia
11       Europe
12       Europe
13       Europe
14       Europe
15    S.America
16       Africa
17    N.America
18      Oceania
19         Asia
Name: Continent, dtype: object

In [17]:
df_countries["Continent"]=="Asia"

0      True
1      True
2     False
3      True
4     False
5      True
6     False
7      True
8     False
9     False
10     True
11    False
12    False
13    False
14    False
15    False
16    False
17    False
18    False
19     True
Name: Continent, dtype: bool

In [19]:
df_countries.loc[[0,1,3,5,7],]

      Country  Population     Area       GDP Continent
0       China     1398.72  9596.96  12234.78      Asia
1       India     1351.16  3287.26   2575.67      Asia
3   Indonesia      268.07  1910.93   1015.54      Asia
5    Pakistan      205.71   881.91    302.14      Asia
7  Bangladesh      167.09   147.57    245.63      Asia

In [20]:
df_countries.loc[df_countries["Continent"]=="Asia",]

       Country  Population     Area       GDP Continent
0        China     1398.72  9596.96  12234.78      Asia
1        India     1351.16  3287.26   2575.67      Asia
3    Indonesia      268.07  1910.93   1015.54      Asia
5     Pakistan      205.71   881.91    302.14      Asia
7   Bangladesh      167.09   147.57    245.63      Asia
10       Japan      126.22   377.97   4872.42      Asia
19  Kazakhstan       18.53  2724.90    159.41      Asia

Filter out all rows where continent is Europe

In [22]:
df_countries.loc[df_countries["Continent"]=="Europe",]

    Country  Population      Area      GDP Continent
8    Russia      146.79  17098.25  1530.75    Europe
11  Germany       83.02    357.11  3693.20    Europe
12   France       67.02    640.68  2582.49    Europe
13       UK       66.44    242.50  2631.23    Europe
14    Italy       60.36    301.34  1943.84    Europe

Calculate total population of each continent

In [ ]:
#names_of_dataframe.groupby(sttring column name)[numericoumn].aggregatefucntionname

In [23]:

df_countries.groupby("Continent")["Population"].sum()

Continent
Africa        244.34
Asia         3535.50
Europe        423.63
N.America     493.91
Oceania        25.47
S.America     255.26
Name: Population, dtype: float64

In [ ]:
# df_countries.groupby("Continent")["GDP"].mean()

Calculate the GDP per capita for each continent | by dividing | the total population of each Continent using Pandas

Group by Indicator
- each
- by 
- per
-

In [24]:
df_countries.head(2)

  Country  Population     Area       GDP Continent
0   China     1398.72  9596.96  12234.78      Asia
1   India     1351.16  3287.26   2575.67      Asia

In [26]:
df_countries.groupby("Continent")["GDP"].sum()

Continent
Africa         543.33
Asia         21405.59
Europe       12381.51
N.America    22290.74
Oceania       1408.68
S.America     2693.00
Name: GDP, dtype: float64

In [27]:
df_countries.groupby("Continent")["Population"].sum()

Continent
Africa        244.34
Asia         3535.50
Europe        423.63
N.America     493.91
Oceania        25.47
S.America     255.26
Name: Population, dtype: float64

In [28]:
df_countries.groupby("Continent")["GDP"].sum() /df_countries.groupby("Continent")["Population"].sum()

Continent
Africa        2.223664
Asia          6.054473
Europe       29.227179
N.America    45.131178
Oceania      55.307420
S.America    10.550027
dtype: float64

In [ ]:
# df_countries.groupby("Continent")["GDP"].sum() / df_countries.groupby("Continent")["Population"].sum()

In [ ]:
len(df_countries)

In [29]:
insurance=pd.read_excel("insurance.xlsx")
insurance.head()

,Policy,Expiry,Location,State,Region,InsuredValue,Construction,BusinessType,Earthquake,Flood
0,100242,2021-01-02,Urban,NY,East,1617630,Frame,Retail,N,N
1,100314,2021-01-02,Urban,NY,East,8678500,Fire Resist,Apartment,Y,Y
2,100359,2021-01-02,Rural,WI,Midwest,2052660,Frame,Farming,N,N
3,100315,2021-01-03,Urban,NY,East,17580000,Frame,Apartment,Y,Y
4,100385,2021-01-03,Urban,NY,East,1925000,Masonry,Hospitality,N,N

- - Calculate the average of InsuredValue per state.

Group by Indicator
##### 1st Hint
- each
- by 
- per
##### Aggregate Keywords

- total --> sum
- average --> mean
- maximum --> max
- minimum -min
- number of something-->count

In [31]:
insurance.head(2)

,Policy,Expiry,Location,State,Region,InsuredValue,Construction,BusinessType,Earthquake,Flood
0,100242,2021-01-02,Urban,NY,East,1617630,Frame,Retail,N,N
1,100314,2021-01-02,Urban,NY,East,8678500,Fire Resist,Apartment,Y,Y

In [32]:
insurance.groupby("State")["InsuredValue"].mean()

State
IL    6.634327e+06
ME    2.484139e+06
MI    2.555560e+06
MN    1.569650e+06
NH    7.660286e+05
NJ    4.391707e+06
NY    5.717441e+06
OH    2.241762e+06
VT    5.342792e+06
WI    4.051166e+06
Name: InsuredValue, dtype: float64

In [ ]:
# insurance.groupby("")[].mean()
#insurance.groupby["State"]["InsuredValue"].mean()--->syntax error

In [ ]:
insurance.groupby("State")["InsuredValue"].mean()

In [34]:
import pandas as pd

data = {
  'Name': ['Alice', 'Bob', 'Charlie', 'Dave', 'Sara', 'Liza', 'Alice', 'Sara', 'Jenny', 'Tom'],
  'Age': [25, 30, 35, 20, 40, 18, 32, 26, 45, 18],
  'City': ['New York', 'Los Angeles', 'Chicago', 'Maryland', 'Misouri', 'Arizona', 'Arizona', 'Misouri', 'New York', 'Arizona'],
  'Profession': ['Engineer', 'Artist', 'Doctor', 'Doctor', 'Doctor', 'Teacher', 'Teacher', 'Doctor', 'Engineer', 'Engineer']
}

df = pd.DataFrame(data)
(df)

      Name  Age         City Profession
0    Alice   25     New York   Engineer
1      Bob   30  Los Angeles     Artist
2  Charlie   35      Chicago     Doctor
3     Dave   20     Maryland     Doctor
4     Sara   40      Misouri     Doctor
5     Liza   18      Arizona    Teacher
6    Alice   32      Arizona    Teacher
7     Sara   26      Misouri     Doctor
8    Jenny   45     New York   Engineer
9      Tom   18      Arizona   Engineer

Print number of rows

In [37]:
df.shape[0] #no of rows

10

Print number of Columns

In [38]:
df.shape[1]

4

In [39]:
df.head()

      Name  Age         City Profession
0    Alice   25     New York   Engineer
1      Bob   30  Los Angeles     Artist
2  Charlie   35      Chicago     Doctor
3     Dave   20     Maryland     Doctor
4     Sara   40      Misouri     Doctor

Filter the DataFrame to select all rows where the 'Age' column is less than 25

In [ ]:
#df.loc[index of rows,name of columns]

In [45]:
df.loc[[2,3],:]

      Name  Age      City Profession
2  Charlie   35   Chicago     Doctor
3     Dave   20  Maryland     Doctor

In [46]:
df.loc[0:5,:]

      Name  Age         City Profession
0    Alice   25     New York   Engineer
1      Bob   30  Los Angeles     Artist
2  Charlie   35      Chicago     Doctor
3     Dave   20     Maryland     Doctor
4     Sara   40      Misouri     Doctor
5     Liza   18      Arizona    Teacher

In [40]:
df["Age"]>25

0    False
1     True
2     True
3    False
4     True
5    False
6     True
7     True
8     True
9    False
Name: Age, dtype: bool

In [44]:
df.loc[[1,2,4],]

      Name  Age         City Profession
1      Bob   30  Los Angeles     Artist
2  Charlie   35      Chicago     Doctor
4     Sara   40      Misouri     Doctor

In [42]:
df.loc[df["Age"]>25,]

      Name  Age         City Profession
1      Bob   30  Los Angeles     Artist
2  Charlie   35      Chicago     Doctor
4     Sara   40      Misouri     Doctor
6    Alice   32      Arizona    Teacher
7     Sara   26      Misouri     Doctor
8    Jenny   45     New York   Engineer

In df.loc you have following options for Rows

- directly give row number
- give range 0:3
- give a condition

## Loc

Select the 'Name' column for the first two rows (index 0 and 1) from the DataFrame

In [48]:
df.head(2)

    Name  Age         City Profession
0  Alice   25     New York   Engineer
1    Bob   30  Los Angeles     Artist

In [ ]:
#df.loc[index of rows,name of columns]

In [49]:
df.loc[0:1,"Name"]

0    Alice
1      Bob
Name: Name, dtype: object

In [51]:
df.loc[0:1,["Name","City"]]

    Name         City
0  Alice     New York
1    Bob  Los Angeles

Select the 'Name' and 'City' columns for the first two rows (index 0 and 1) from the DataFrame.

Add a new row with index 6 to the DataFrame using loc[], providing values for 'Name', 'Age', 'City', and 'Occupation

Add a new row with index 11 to the DataFrame using loc[], skipping index 10, and provide values for 'Name', 'Age', 'City', and 'Occupation


### Adding column using loc

Add a new column 'Salary' to the DataFrame and assign values to each row using loc[].

### To append value at end of df

In [ ]:
df.loc[len(df)] = ['Gravelbike', 45, 'Misouri','Scientist', 40000]

Append a new row to the DataFrame using loc[len(df)], providing values for 'Name', 'Age', 'City', 'Occupation', and 'Salary

In [ ]:
df.loc[df.shape[0]] = ['Kasha', 45, 'Misouri','Scientist', 40000]

In [ ]:
df.drop(6)

In [ ]:
df.drop(1,axis=0) #axis 0 for rows

In [ ]:
df.drop('City',axis=1) # axis 1 for columns

In [ ]:
df.loc[df.shape[0]] = ['Stephen', 23, 'Misouri','Teacher', 15000]
df

In [ ]:
df

In [ ]:
df.loc[12] = ['Iska', 19, 'Arizona','Artist',45000]
df.loc[13] = ['Leon', 22, 'New York','DataScientist',65000]
df.loc[14] = ['Nada', 23, 'Maryland','Engineer',70000]

### Inplace and Assignment Operator

In [ ]:
df = df.drop(14) #Assignment Operator

In [ ]:
df.drop(13,axis=0,inplace=True)

### Sort Values

- data_sorted = df.sort_values(by='City')
- data_sorted = df.sort_values('City')

In [ ]:
data_sorted = df.sort_values(by='City')
data_sorted

In [ ]:
data_sorted = df.sort_values(['Age'])
data_sorted

In [ ]:
data_sorted = df.sort_values(['Age', 'Salary'])
data_sorted

### order of sorting

In [ ]:
data_sorted = df.sort_values(by=['City', 'Salary'], ascending=False)
data_sorted

In [ ]:
a_list=[3,4,5,6,7,8,9,10,2,3]
for leon in a_list:
    print(leon)

In [ ]:
for i in df['City']:
    print(i)

In [ ]:
countries_data = {
    'country': ['Germany', 'France', 'Italy', 'Spain', 'Netherlands', 'Sweden', 'Norway', 'Belgium', 'Austria', 'Denmark'],
    'population': [1000000, 2000000, 1500000, 800000, 2500000, 3000000, 500000, 1800000, 1200000, 2200000],
    'area': [500, 800, 600, 450, 900, 1200, 300, 700, 550, 850],
    'gdp': [500000000, 1200000000, 750000000, 400000000, 1500000000, 1800000000, 250000000, 900000000, 650000000, 1400000000]
}

countries_df = pd.DataFrame(countries_data)

countries_df

In [ ]:
countries_df.sum()

In [ ]:
# Select specific columns and calculate their sum
result = countries_df.loc[:, ['population', 'gdp']].sum()

print(result)

In [ ]:
# Select specific columns and calculate their sum
result = countries_df.loc[:, ['population', 'gdp']].min()

print(result)

- count() Number of non-null Values
- sum() Sum of Values
- mean() Mean of Values
- median() Median of Values  -> the middle value in sorted numerical data.
- mode() Mode of Values -> Finds the value(s) that appear most frequently in a column
- var() Variance of the Values -> measures the spread of data from the mean.
- std() Standard Deviation of the Values -> the square root of the variance, Measures how much data deviates from the mean on average.
- min() Minimum Value
- max() Maximum Value
- prod() Product of Values -> Computes the product of all values in a column or DataFrame, skips NaN values
- cumsum() Cumulative Sum -> Calculates the cumulative sum of values along a column or row, Adds each value to the sum of all previous values
- cumprod() Cumulative Product -> Computes the cumulative product of values in a column or row,Multiplies each value by the product of all previous values.
- corr() Correlation Matrix ->showing pairwise correlation coefficients between columns, Correlation values range from -1 to 1, indicating the strength and direction of the relationship.

In [ ]:
list_a={
    'numbers':[10,20,30,40]
}
numbers_df=pd.DataFrame(list_a)
numbers_df

In [ ]:
numbers_df.sum()

In [ ]:
numbers_df.cumsum()

In [ ]:
numbers_df.prod()

In [ ]:
numbers_df.cumprod()

In [ ]:
countries_df.loc[:, ['population']].mean()

In [ ]:
countries_df.loc[:, ['population', 'gdp']].mean()

In [ ]:
countries_df['population'].describe()

In [ ]:
countries_df.describe()

In [ ]:
df.count()

### Null Value (OPTIONAL)

In [ ]:
import numpy as np
df.loc[len(df)] = ['Gravelbike', 45, 'Misouri','Scientist',np.nan ]
df

In [ ]:
df.describe()

In [ ]:
df.count()

### Correlation

In [ ]:
df.loc[:, ['Age','Salary']].corr()

### UNIQUE

In [ ]:
df['Profession'].unique()

In [ ]:
df['Age'].unique()

In [ ]:
countries_df['country'].unique()

### Value Counts

### verifying correlation ( Optional)

In [ ]:
df[['Age','Salary']]

In [ ]:
df.loc[:, ['Age','Salary']].corr()